#第10章用スクリプト
getwd()                        #working directoryの確認
source('myfunc/myfunc.R')      #自作関数の読み込み
library(rstan)                 #パッケージrstanの呼び出し
rstan_options(auto_write=T)
options(mc.cores=parallel::detectCores())

#表10.1「知覚時間」データ入力
y1<-c(
   28.10,31.67,33.60,25.37,32.03,32.21,29.62,29.69,29.65,28.86,
   31.35,30.10,30.64,32.65,34.80,32.24,31.27,30.31,30.49,38.30,
   33.32,31.82,31.94,34.10,31.34,29.52,34.38,30.54,32.96,30.75,
   33.95,30.16,29.60,30.10,27.39,28.50,26.07,28.08,30.59,30.18,
   34.48,28.44,28.95,30.33,28.61,28.68,28.34,28.00,29.74,29.81,
   28.17,31.10,29.84,30.06,32.11,33.85,36.45,30.64,36.35,29.72,
   29.58,34.12,27.92,26.39,27.98,32.27,25.27,31.28,31.19,28.81,
   31.92,30.81,31.02,33.46,36.87,31.53,28.56,30.16,32.52,31.14)
#表10.9「知覚時間」データ入力
y2<-c(
   33.00,31.92,27.85,30.99,31.61,30.50,31.06,29.48,33.08,32.55,
   34.89,32.33,31.98,34.22,35.48,27.54,35.53,28.57,29.57,33.94,
   36.30,30.51,33.70,28.77,32.60,35.11,29.35,31.99,33.22,33.04,
   27.34,33.40,24.63,27.24,28.27,31.85,25.05,29.04,31.29,30.20,
   29.38,29.80,31.28,31.54,31.83,30.50,27.22,30.06,29.61,35.33,
   35.69,35.02,31.94,33.98,30.38,26.21,34.91,33.36,31.37,33.49,
   30.00,31.23,30.09,34.73,35.43,33.44,34.65,33.35,30.41,33.41,
   26.35,28.61,29.52,27.63,27.05,33.32,29.85,34.44,28.52,32.40)
#表10.13「知覚時間」データ入力
y3<-c(
   35.24,31.29,31.00,32.23,30.13,26.27,30.71,29.88,31.11,26.99,
   28.73,31.34,32.09,33.68,31.60,32.17,29.54,28.75,29.57,26.70,
   29.59,30.51,32.05,28.99,28.10,31.29,28.48,30.80,33.88,33.52,
   34.34,29.29,30.00,33.31,27.98,29.23,32.34,30.54,31.82,31.85,
   27.88,30.26,29.96,24.01,29.48,34.10,30.69,27.32,26.67,33.97,
   27.20,30.14,31.62,29.46,29.19,29.18,31.26,28.61,26.66,25.21,
   28.52,29.13,26.07,30.27,27.26,26.49,30.62,29.11,29.28,30.80,
   32.03,32.48,28.64,24.34,29.19,25.09,35.23,24.04,30.39,31.51)
A <- rep(1:4,each=10,times=2)       #要因Aの水準の指定
B <- rep(1:2,each=40)               #要因Bの水準の指定

#2要因実験の推測 例１
bbb1<-E2Ind(y1,A,B,prior=T,mL=0, mH=100, sL=0, sH=50)

#表10.3  母数の推定結果
gqcal(bbb1$mu,        2)    ;
gqcal(bbb1$muA,       2)    ;
gqcal(bbb1$muB[,1],   2)    ;
gqcal(bbb1$muAB[,,1], 2)    ;

#表10.4 水準・交互作用が0より大きい(小さい)確率
apply(bbb1$muA>0,2,mean);mean(bbb1$muB[,1]>0);
apply(bbb1$muAB[,,1]>0,2,mean);
apply(bbb1$muA<=0,2,mean);mean(bbb1$muB[,1]<=0);
apply(bbb1$muAB[,,1]<=0,2,mean);

#表10.5 効果の大きさに関する生成量の推定結果
gqcal(bbb1$sigmaA, 3)    ;
gqcal(bbb1$sigmaB, 3)    ;
gqcal(bbb1$sigmaAB,3)    ;
gqcal(bbb1$sigmaE, 2)    ;
gqcal(bbb1$eta2A,  3)    ;
gqcal(bbb1$eta2B,  3)    ;
gqcal(bbb1$eta2AB, 3)    ;
gqcal(bbb1$eta2T,  3)    ;
gqcal(bbb1$deltaA, 3)    ;
gqcal(bbb1$deltaB, 3)    ;
gqcal(bbb1$deltaAB,3)    ;

#表10.6 セル平均の推定結果(教科書とは出力の順番が異なる)
cellmean  <-cbind(bbb1$cellmea[,,1]  ,bbb1$cellmean[,,2])
colnames(cellmean)<-as.vector(outer(1:4,1:2,paste,sep=","))
gqcal(cellmean,2)  ;  

#表10.7 
E2betw_level(bbb1,degits=3,H="A",F=3,I=1,J=2,cr1=1)

#表10.8 
E2betw_level(bbb1,degits=3,H="B",F=2,I=4,J=3,cr1=1)

#2要因実験の推測 例２
bbb2<-E2Ind(y2,A,B,prior=T,mL=0, mH=100, sL=0, sH=50)

#表10.10 水準・交互作用が0より大きい(小さい)確率
apply(bbb2$muA>0,2,mean);mean(bbb2$muB[,1]>0);
apply(bbb2$muAB[,,1]>0,2,mean);
apply(bbb2$muA<=0,2,mean);mean(bbb2$muB[,1]<=0);
apply(bbb2$muAB[,,1]<=0,2,mean);

#表10.11 効果の大きさに関する生成量の推定結果
gqcal(bbb2$eta2A,  3)    ;
gqcal(bbb2$deltaA, 3)    ;

#表10.12 
phc02(c=0,bbb2$muA,cc="gtc",3)

#連言命題が正しい確率  p.169
printIJ(bbb2$U2A,3,IJ=rbind(c(2,1),c(3,1),c(1,4)))

#2要因実験の推測 例３
bbb3<-E2Ind(y3,A,B,prior=T,mL=0, mH=100, sL=0, sH=50)

#表10.14 水準・交互作用が0より大きい(小さい)確率
apply(bbb3$muA>0,2,mean);mean(bbb3$muB[,1]>0);
apply(bbb3$muAB[,,1]>0,2,mean);
apply(bbb3$muA<=0,2,mean);mean(bbb3$muB[,1]<=0);
apply(bbb3$muAB[,,1]<=0,2,mean);

#表10.15 効果の大きさに関する生成量の推定結果
gqcal(bbb3$eta2B,  3)    ;
gqcal(bbb3$deltaB, 3)    ;

